
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       3 |          1 |          0 |
## Affected resources by action

|  Action  | Resources                                                        |
|:--------:|:-----------------------------------------------------------------|
|    🟢     | `module.ih_8_repos["aws-control"].github_branch_default.main`    |
|    🟢     | `module.ih_8_repos["aws-control"].github_branch_protection.main` |
|    🟢     | `module.ih_8_repos["aws-control"].github_repository.repo`        |
|    🟢     | `github_organization_settings.infrahouse:`                       |
|    🟡     | `github_repository.terraform-template`                           |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/33112e73-b0ed-4998-b39c-f4a793a8abd9/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
github_repository.terraform-template: Refreshing state... [id=terraform-template]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["github-control"].github_actions_secret.role[0]: Refreshing state... [id=github-control:AWS_ROLE]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
module.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.terraform-template will be updated in-place
  ~ resource "github_repository" "terraform-template" {
        id                          = "terraform-template"
      ~ is_template                 = false -> true
        name                        = "terraform-template"
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ih_8_repos["aws-control"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "aws-control"
    }

  # module.ih_8_repos["aws-control"].github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Terraform Plan",
            ]
          + strict   = true
        }
    }

  # module.ih_8_repos["aws-control"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "InfraHouse Basic AWS configuration"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "aws-control"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "infrahouse8"
          + repository           = "terraform-template"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: github_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_repository.terraform-template: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["github-control"].github_actions_secret.role[0]: Refreshing state... [id=github-control:AWS_ROLE]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # github_repository.terraform-template will be updated in-place%0A  ~ resource "github_repository" "terraform-template" {%0A        id                          = "terraform-template"%0A      ~ is_template                 = false -> true%0A        name                        = "terraform-template"%0A        # (30 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ih_8_repos["aws-control"].github_branch_default.main will be created%0A  + resource "github_branch_default" "main" {%0A      + branch     = "main"%0A      + id         = (known after apply)%0A      + rename     = false%0A      + repository = "aws-control"%0A    }%0A%0A  # module.ih_8_repos["aws-control"].github_branch_protection.main will be created%0A  + resource "github_branch_protection" "main" {%0A      + allows_deletions                = false%0A      + allows_force_pushes             = false%0A      + blocks_creations                = false%0A      + enforce_admins                  = false%0A      + id                              = (known after apply)%0A      + lock_branch                     = false%0A      + pattern                         = "main"%0A      + repository_id                   = (known after apply)%0A      + require_conversation_resolution = false%0A      + require_signed_commits          = false%0A      + required_linear_history         = false%0A%0A      + required_pull_request_reviews {%0A          + require_last_push_approval      = false%0A          + required_approving_review_count = 0%0A        }%0A%0A      + required_status_checks {%0A          + contexts = [%0A              + "Terraform Plan",%0A            ]%0A          + strict   = true%0A        }%0A    }%0A%0A  # module.ih_8_repos["aws-control"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "InfraHouse Basic AWS configuration"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_downloads               = false%0A      + has_issues                  = true%0A      + has_projects                = false%0A      + has_wiki                    = false%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "aws-control"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = (known after apply)%0A      + vulnerability_alerts        = true%0A%0A      + security_and_analysis {%0A          + advanced_security {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning_push_protection {%0A              + status = (known after apply)%0A            }%0A        }%0A%0A      + template {%0A          + include_all_branches = false%0A          + owner                = "infrahouse8"%0A          + repository           = "terraform-template"%0A        }%0A    }%0A%0APlan: 3 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvMzMxMTJlNzMtYjBlZC00OTk4LWIzOWMtZjRhNzkzYThhYmQ5L3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3JlcG9zaXRvcnkudGVycmFmb3JtLXRlbXBsYXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX2RlZmF1bHQubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnJvbGVbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSkNlaVVjNENFWnZRXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVB8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVxuICBcdTAwMWJbMzNtflx1MDAxYlswbSB1cGRhdGUgaW4tcGxhY2Vcblx1MDAxYlswbVxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cblx1MDAxYlsxbSAgIyBnaXRodWJfcmVwb3NpdG9yeS50ZXJyYWZvcm0tdGVtcGxhdGVcdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInRlcnJhZm9ybS10ZW1wbGF0ZVwiIHtcbiAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIlxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaXNfdGVtcGxhdGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gZmFsc2UgXHUwMDFiWzMzbS0+XHUwMDFiWzBtIFx1MDAxYlswbXRydWVcbiAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIlxuICAgICAgICBcdTAwMWJbOTBtIyAoMzAgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuXG4gICAgICAgIFx1MDAxYls5MG0jICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX2RlZmF1bHQubWFpblx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYnJhbmNoX2RlZmF1bHRcIiBcIm1haW5cIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgID0gXCJtYWluXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlcdTAwMWJbMG1cdTAwMWJbMG0gPSBcImF3cy1jb250cm9sXCJcbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvblwiIFwibWFpblwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93c19kZWxldGlvbnNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2ZvcmNlX3B1c2hlc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ibG9ja3NfY3JlYXRpb25zXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWVuZm9yY2VfYWRtaW5zXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWxvY2tfYnJhbmNoXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcGF0dGVyblx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICA9IFwibWFpblwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5X2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZV9jb252ZXJzYXRpb25fcmVzb2x1dGlvblx1MDAxYlswbVx1MDAxYlswbSA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXF1aXJlX3NpZ25lZF9jb21taXRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2xpbmVhcl9oaXN0b3J5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBmYWxzZVxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1yZXF1aXJlZF9wdWxsX3JlcXVlc3RfcmV2aWV3cyB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZV9sYXN0X3B1c2hfYXBwcm92YWxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZWRfYXBwcm92aW5nX3Jldmlld19jb3VudFx1MDAxYlswbVx1MDAxYlswbSA9IDBcbiAgICAgICAgfVxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1yZXF1aXJlZF9zdGF0dXNfY2hlY2tzIHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1jb250ZXh0c1x1MDAxYlswbVx1MDAxYlswbSA9IFtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXCJUZXJyYWZvcm0gUGxhblwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0cmljdFx1MDAxYlswbVx1MDAxYlswbSAgID0gdHJ1ZVxuICAgICAgICB9XG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfYXV0b19tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X21lcmdlX2NvbW1pdFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3JlYmFzZV9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3NxdWFzaF9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWZhdWx0X2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWxldGVfYnJhbmNoX29uX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVzY3JpcHRpb25cdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gXCJJbmZyYUhvdXNlIEJhc2ljIEFXUyBjb25maWd1cmF0aW9uXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWV0YWdcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWZ1bGxfbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWdpdF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19kb3dubG9hZHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfaXNzdWVzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfcHJvamVjdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaGFzX3dpa2lcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0bWxfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW1lcmdlX2NvbW1pdF9tZXNzYWdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IFwiUFJfVElUTEVcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXdzLWNvbnRyb2xcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbm9kZV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcHJpdmF0ZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb19pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJDT01NSVRfTUVTU0FHRVNcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3NoX2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3ZuX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdnVsbmVyYWJpbGl0eV9hbGVydHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gdHJ1ZVxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbWFkdmFuY2VkX3NlY3VyaXR5IHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG10ZW1wbGF0ZSB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaW5jbHVkZV9hbGxfYnJhbmNoZXNcdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZVxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW93bmVyXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlOFwiXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgPSBcInRlcnJhZm9ybS10ZW1wbGF0ZVwiXG4gICAgICAgIH1cbiAgICB9XG5cblx1MDAxYlswbVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDMgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXHUwMDFiWzBtXHUwMDFiWzkwbVxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3JlcG9zaXRvcnkudGVycmFmb3JtLXRlbXBsYXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnJvbGVbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVBdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ2VpVWM0Q0VadlFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGUlMEEgIFx1MDAxYlszM21+XHUwMDFiWzBtIHVwZGF0ZSBpbi1wbGFjZSUwQVx1MDAxYlswbSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQVx1MDAxYlsxbSAgIyBnaXRodWJfcmVwb3NpdG9yeS50ZXJyYWZvcm0tdGVtcGxhdGVcdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIiB7JTBBICAgICAgICBcdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS10ZW1wbGF0ZVwiJTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaXNfdGVtcGxhdGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gZmFsc2UgXHUwMDFiWzMzbS0+XHUwMDFiWzBtIFx1MDAxYlswbXRydWUlMEEgICAgICAgIFx1MDAxYlsxbVx1MDAxYlswbW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLXRlbXBsYXRlXCIlMEEgICAgICAgIFx1MDAxYls5MG0jICgzMCB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBJTBBICAgICAgICBcdTAwMWJbOTBtIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW5cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9icmFuY2hfZGVmYXVsdFwiIFwibWFpblwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgID0gXCJtYWluXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlcdTAwMWJbMG1cdTAwMWJbMG0gPSBcImF3cy1jb250cm9sXCIlMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYnJhbmNoX3Byb3RlY3Rpb25cIiBcIm1haW5cIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2RlbGV0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2ZvcmNlX3B1c2hlc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYmxvY2tzX2NyZWF0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZW5mb3JjZV9hZG1pbnNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1sb2NrX2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wYXR0ZXJuXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJtYWluXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5X2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfY29udmVyc2F0aW9uX3Jlc29sdXRpb25cdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfc2lnbmVkX2NvbW1pdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2xpbmVhcl9oaXN0b3J5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBmYWxzZSUwQSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXJlcXVpcmVkX3B1bGxfcmVxdWVzdF9yZXZpZXdzIHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZV9sYXN0X3B1c2hfYXBwcm92YWxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2FwcHJvdmluZ19yZXZpZXdfY291bnRcdTAwMWJbMG1cdTAwMWJbMG0gPSAwJTBBICAgICAgICB9JTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtcmVxdWlyZWRfc3RhdHVzX2NoZWNrcyB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWNvbnRleHRzXHUwMDFiWzBtXHUwMDFiWzBtID0gWyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXCJUZXJyYWZvcm0gUGxhblwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RyaWN0XHUwMDFiWzBtXHUwMDFiWzBtICAgPSB0cnVlJTBBICAgICAgICB9JTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19hdXRvX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X21lcmdlX2NvbW1pdFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19yZWJhc2VfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfc3F1YXNoX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlbGV0ZV9icmFuY2hfb25fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVzY3JpcHRpb25cdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gXCJJbmZyYUhvdXNlIEJhc2ljIEFXUyBjb25maWd1cmF0aW9uXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWdpdF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZG93bmxvYWRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfcHJvamVjdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc193aWtpXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImF3cy1jb250cm9sXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcHJpdmF0ZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNzaF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZ1bG5lcmFiaWxpdHlfYWxlcnRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IHRydWUlMEElMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMgeyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1hZHZhbmNlZF9zZWN1cml0eSB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmcgeyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgIH0lMEElMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXRlbXBsYXRlIHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaW5jbHVkZV9hbGxfYnJhbmNoZXNcdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1vd25lclx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZThcIiUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICA9IFwidGVycmFmb3JtLXRlbXBsYXRlXCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQVx1MDAxYlswbVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDMgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQVx1MDAxYlswbVx1MDAxYls5MG0lMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG0lMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMywgImNoYW5nZSI6IDEsICJkZXN0cm95IjogMH19```
</p></details>